Revit 2027 API
GroupTypeId.ConceptualEnergyDataBuildingServices Property
 Energy Model - Building Services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConceptualEnergyDataBuildingServices { get; }
Public Shared ReadOnly Property ConceptualEnergyDataBuildingServices As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConceptualEnergyDataBuildingServices {
	ForgeTypeId^ get ();
}
static member ConceptualEnergyDataBuildingServices : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace